w6d3/routes/app/controllers/users_controller.rb

  def index
    # render plain: 'Hi'
    render json: User.all
---
SELECT "users".* FROM "users"

  def create
    user = User.new(params.require(:user).permit(:name, :email))
    # replace the `user_attributes_here` with the actual attribute keys
    # user.save!
    # render json: user

    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "123"], ["email", " "], ["created_at", "2020-12-30 00:27:18.812783"], ["updated_at", "2020-12-30 00:27:18.812783"]]

  def show
    # render json: params
    # user = User.find(params[:id])
    render json: User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]