w8d1/reddit_app/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a"], ["description", "a"], ["user_id", 2], ["created_at", "2021-01-11 20:00:29.841463"], ["updated_at", "2021-01-11 20:00:29.841463"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = params[:sub][:user_id]
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @sub = Sub.find_by_id(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "b"], ["updated_at", "2021-01-11 20:00:51.132957"], ["id", 1]]
---
    def update
        @sub = Sub.find_by_id(params[:id])
        if @sub
            if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sub = Sub.find_by_id(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def require_is_moderator
        unless current_user.id == Sub.find_by_id(params[:id]).user_id