w8d1/reddit_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "asdfasdfasdfasdf"], ["password_digest", "$2a$12$NVZhdh4ynqZEG4BW7oz8dumeL1bSyDp.eQLP3Zyr2Yw6beeH/RJ4a"], ["updated_at", "2021-01-11 17:52:30.311689"], ["id", 1]]
---
  def update
    @user = User.find_by_id(params[:id])
    if @user
      if @user.update(user_params)