w6d5/cats_99/app/controllers/cats_controller.rb

  def create
    @kitty = new_cat

    if @kitty.valid?
      @kitty.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @kitty = find_cat
    @kitty.update(cat_params)
---
UPDATE "cats" SET "birth_date" = $1, "name" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["birth_date", "2002-05-05"], ["name", "Felicity"], ["description", "Shes orange and kind of cute. "], ["updated_at", "2021-01-03 01:19:00.966164"], ["id", 93]]

  def find_cat
    Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]