w6d5/cats_99/app/views/cats/index.html.erb

SELECT "cats".* FROM "cats"
---
        <tr>
            <%Cat.attributes.each do |attr_name|%>